## Updateing COLUMNS

In [1]:
import pandas as pd

In [2]:
people = {
    "first": ['Ali', 'Talha', 'Taha'],
    "last": ['Haider', 'Ahmad', 'Ahmad'],
    "email": ['AliHaider@gmail.com', 'TalhaAhmad@email.com', 'TahaAhmad@email.com'],
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first    last                 email
0    Ali  Haider   AliHaider@gmail.com
1  Talha   Ahmad  TalhaAhmad@email.com
2   Taha   Ahmad   TahaAhmad@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ['first_name', 'last_name', 'email']

In [7]:
df

  first_name last_name                 email
0        Ali    Haider   AliHaider@gmail.com
1      Talha     Ahmad  TalhaAhmad@email.com
2       Taha     Ahmad   TahaAhmad@email.com

In [8]:
# Suppose we want to make all column name uper case.
df.columns  = [ x.upper() for x in df.columns]

In [9]:
df

  FIRST_NAME LAST_NAME                 EMAIL
0        Ali    Haider   AliHaider@gmail.com
1      Talha     Ahmad  TalhaAhmad@email.com
2       Taha     Ahmad   TahaAhmad@email.com

In [13]:
# Replace spaces wtih the uderscores .
df.columns = df.columns.str.replace('_', ' ')
df

  FIRST NAME LAST NAME                 EMAIL
0        Ali    Haider   AliHaider@gmail.com
1      Talha     Ahmad  TalhaAhmad@email.com
2       Taha     Ahmad   TahaAhmad@email.com

In [14]:
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME LAST_NAME                 EMAIL
0        Ali    Haider   AliHaider@gmail.com
1      Talha     Ahmad  TalhaAhmad@email.com
2       Taha     Ahmad   TahaAhmad@email.com

In [16]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                 email
0        Ali    Haider   AliHaider@gmail.com
1      Talha     Ahmad  TalhaAhmad@email.com
2       Taha     Ahmad   TahaAhmad@email.com

In [18]:
# if we want to change specfic column names then we can use dict... we have to also give [ inplace=True ].

df.rename(columns={
    'first_name': 'first',
    'last_name': 'last'
}, inplace=True)
df

   first    last                 email
0    Ali  Haider   AliHaider@gmail.com
1  Talha   Ahmad  TalhaAhmad@email.com
2   Taha   Ahmad   TahaAhmad@email.com

## Updateing ROWS

In [23]:
filt = (df['first']=='Taha') & (df['last']=='Ali')
df.loc[filt, 'last'] = 'Ali'
df.loc[filt, 'email'] = 'TahaAli@gmial.com'
df

   first    last                 email
0    Ali  Haider   AliHaider@gmail.com
1  Talha   Ahmad  TalhaAhmad@email.com
2   Taha     Ali     TahaAli@gmial.com

In [24]:
df.loc[2, ['last', 'email']] = ['Ahmad', 'TahaAhmad@gmail.com']
df

   first    last                 email
0    Ali  Haider   AliHaider@gmail.com
1  Talha   Ahmad  TalhaAhmad@email.com
2   Taha   Ahmad   TahaAhmad@gmail.com

In [25]:
df

   first    last                 email
0    Ali  Haider   AliHaider@gmail.com
1  Talha   Ahmad  TalhaAhmad@email.com
2   Taha   Ahmad   TahaAhmad@gmail.com

In [29]:
print(type(df[['email', 'last']]))
print( type(df['email']) )

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [30]:
df['email'].str.lower()

0     alihaider@gmail.com
1    talhaahmad@email.com
2     tahaahmad@gmail.com
Name: email, dtype: object

In [31]:
df['email'] = df['email'].str.lower()

In [32]:
df

   first    last                 email
0    Ali  Haider   alihaider@gmail.com
1  Talha   Ahmad  talhaahmad@email.com
2   Taha   Ahmad   tahaahmad@gmail.com

#### There are four methods that we use 
1. apply
2. map
3. applymap
4. replace

In [34]:
# Apply method is used for calling a function on our value ...
# Apply can either work on a dateframe or a series ...

# First we see how apply works for a series ...

# Running apply to series applys to all of its values ...

# Runing apply to dataframe applys to all of its Series...

df['email'].apply(len)

0    19
1    20
2    19
Name: email, dtype: int64

In [36]:
# Function that gives the upper case version of the emails ...


def update_email(email):
    return email.upper()

In [37]:
df['email'].apply(update_email)

0     ALIHAIDER@GMAIL.COM
1    TALHAAHMAD@EMAIL.COM
2     TAHAAHMAD@GMAIL.COM
Name: email, dtype: object

In [38]:
df

   first    last                 email
0    Ali  Haider   alihaider@gmail.com
1  Talha   Ahmad  talhaahmad@email.com
2   Taha   Ahmad   tahaahmad@gmail.com

In [39]:
df['email'] = df['email'].apply(update_email)

In [40]:
df

   first    last                 email
0    Ali  Haider   ALIHAIDER@GMAIL.COM
1  Talha   Ahmad  TALHAAHMAD@EMAIL.COM
2   Taha   Ahmad   TAHAAHMAD@GMAIL.COM

In [41]:
# lambda functions ...

df['email'] = df['email'].apply(lambda x: x.lower())

In [42]:
df

   first    last                 email
0    Ali  Haider   alihaider@gmail.com
1  Talha   Ahmad  talhaahmad@email.com
2   Taha   Ahmad   tahaahmad@gmail.com

In [44]:
# Now look how apply works on dataframe ...

df.apply(len)

first    3
last     3
email    3
dtype: int64

In [45]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [46]:
df.apply(pd.Series.min)

first                    Ali
last                   Ahmad
email    alihaider@gmail.com
dtype: object

In [48]:
df.apply(lambda x : x.min())

first                    Ali
last                   Ahmad
email    alihaider@gmail.com
dtype: object